app/controllers/api/sessions_controller.rb

   def create
      # Find user by credentials
      username = ''
      if params[:user][:email]
         username = User.find_by(email: params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sdf"], ["LIMIT", 1]]